{
    "data": [
        {
            "title": "Who Me?",
            "text": "Growing up I was always around technology, I found it fascinating; it almost seemed like I was a wizard from a fantasy story. I was seemed so flexible more capable than what pen and paper could contain. It eventually became my conduit to contain all my curiosity and creative. It allowed me to blend my curiosity and interest in creating applications with my desire to present what I had built with a 'fresh coat of paint' (to be aesthetically pleasing). Though there was one downside; it was fragile, I would constantly lose or break the electronics that I owned and it only seemed like it was only happening to my electronics. The amount of times I had wished I had 'lost' on of the those textbooks, I would even for 15 minutes as a kid is countless. It got so bad my father would end up getting me a T-Shirt saying 'I Break Things'. Eventually this phenomenon would come to be known as <i>The Curse</i>. It is a pretty cheesy name and while annoying in the moment it has only taught me to build things more resiliently and to be more methodical with how I handle my things.<br><br>&#9;I grew up most of my life on the coastal outskirts of Los Angeles; it was around the area known as space park, which is where my mother worked. My father on the other hand was a programmer; eventually landing a role as software architect at his friends company. Neither where as artistic as I was, it must of skipped a generation. I am grateful to where I lived and the people my parents know; Some of them would play a pivotal role in my development. I was fortunate enough amazing and enthusiastic teachers and friends that friends that would not only encourage me on the path I have took, but partake in helping me walk down that path."
        },
        {
            "title": "A Games Influence",
            "text": "My mother had a computer in the office area which she would use to get herself through college and do taxes and stuff, but this was the first impactful computer in which I would play Minecraft from. This game would teach me a fundamental part of computer science (even though I would not know it at the time) logic gates, which I would use to automate some mundane task within the game. This would also be my first introduction into what it looks like express myself creatively (outside of the occasional doodle). I would play Minecraft on this computer for hours, eventually leading to me getting my own computer. <br><br>&#9;With the acquisition of my own computer came with the desire to create my own game. I would create small flash games using the Game Maker Application. I would then share these games with my friends in school; deleting them when I got bored of them moving onto the next game. I regret deleting them, I had put a lot of effort into these games while not perfect were decent; this also would lead to a precedent when working on personal project going forward. <br><br>&#9;My friends and I later go on to start a Modded Minecraft Server on the Mod Pack Tekkit influenced by the Youtubers Yogscast. Within this Mod Pack contained a mod that allowed you to control robots(turtles) with the LUA programming language. With these robots you could interact with the game in the same way a player could interact with the game allowing me to automate the game on a completely different level (Which amazed me to no end) and I could mess with my friend too. Eventually we got bored of playing on this server and start playing on a vanilla server however we were going into high school and our parents weren't willing to pay the costs of the servers like before. This would lead to me to host my own server on an AWS EC2 Instance (That was significantly harder than it is now), this would be the last server we end up playing."
        },
        {
            "title": "A Season of Growth",
            "text": "It was time to move on to new things; my curiosity and focus demanded it. Over the summer of my freshman year of High School my father would tutor me in Web Programming Fundamentals; this changed the trajectory of my path. I would later (in high school) to use those skills to pick up odd jobs around where I use to live in LA to make some cash on the side on top of school and extra curriculars. These jobs would equate to small feature and bug fixes to a website the person/small business would already own. During my senior year, I would teach my fellow student what I had learned about web development. <br><br>&#9;However this path was full of many twists and turn. My attention went from Game Programming and to API Scraping, but the 2 things that had bent the path the most was Robotics and Neural Networks. These were worlds I had no clue existed until I had stumbled onto them in High School.<br><br>&#9;My first introduction into Robotics was through a pseudo-college class, principle of engineering. This was a college class that would span a full school year and still offer college credit; within this class we would build different contraptions, each contraption aimed to accomplish a single objective. An objective could range from sorting marbles to bridge building. A lot of the contraptions were programmed in the IDE/Language, RobotC, a limited/simplified version of C meant to program hobby robots. I had a blast within this class, so much so I would join the robotics club were I would go on to build my OMNI-Directional Robot. I also created a close bond with the teacher of this class, Mr. Hagen, choosing to take a few more of his class.<br><br>&#9; One of my friends I had acquired within this engineering class was absolutely enthralled with the idea of AI. He would eventually start the computer science club so that he could teach others about neural network, data classification, etc. Well, initially I wasn't all that interested in the Idea, while interesting I had my robots to work on after all; and if Lieutenant Data from Star Trek TNG has taught me is that what makes a person is the soul and not in their capabilities. Oh how ignorant I really was, it wasn't until I had watched Eureka (and had seen more what neural network really were about on youtube) I understood the significance and benefits that AI could provide; I was in. Move over robotics I have a new thing to learn, I would scour the internet for more videos on neural nets, bombard my friend with question, and try to implement my own network. What would I try to implement,  well obviously my own SARAH; did I accomplish my task? no. Did I get anywhere close? also no. But I had fun doing so.<br><br>&#9;My friend would go on to gradate high school and left me in charge of the computer science club. Now I was the teacher, what would I go to teacher all the members of the club? basic web development. At the time, I was taking on web dev projects on top of going to school to make some extra cash on the side. I also felt like I understood the subject the most, so that is what I taught. I was not prepared, luckily Mr. Hagen was my mentor for the club, he guided me as best as he could."
        },
        {
            "title": "Finding My Style",
            "text": "My life didn't only revolve around programming and engineering; I was also very artistic. Up until high school I used Minecraft or game design as my medium for artistic expression. This changed with my digital media class; this class introduced me to Adobe Illustrator and to Photoshop, which are applications that me or my family could afford at the time. This class taught me the ins and outs of vector art and its possible applications from flyers to graphic tees, but the thing that drew me in the most was it captured the same essence as Minecraft and Game Dev. I would constant spend my time in this class working on different designs and making sure all my designs looked good. The day I had completed that class was a sad day, I no longer had access the Adobe Creative Suite 6. <br><br>&#9;The Veil was left open for me; it had spiked my curiosity. What other things can be a conduit for me? Drawing? no, too frustrating. Acting? nope, too limit and not my cup of tea. Photography? hang on, there is something to this. Thinking back on it was a bit more obvious that I would end up liking photography than I would have thought. It is a perfect balance of math and creativity, where the math isn't a necessity to know, but will only enhance my skills as a photographer. The only issue at the time is access to a camera; phone cameras at the time were almost unusable, the first camera ever invented had a better photo quality. You could use a disposable film camera, but for a kid my age getting the film developed into actual photos would be pretty cumbersome and I didn't have the many to do that much less than get a digital camera. Luckily, the stars align not once, but multiple times for me.<br><br>&#9;The First being photography was a very popular hobby within my family giving me the ability to borrow their camera; however, it was only during times I was spending time with them like during hikes. Alright so knowing me, that wouldn't be enough, fortunately my high school had a film club, which allowed us to borrow equipment for our project film. This club was also how I found out I did not like acting; and yes, the embarrassing video that I created are probably still on the internet. Finally, the third fortunate circumstance is that I was able to take the new photography class my high school had just introduced. This taught me a lot and gave me access to a lot; We built our own film camera (Pin Hole Camera), develop our own film, and gave me access to Photoshop! Yes, we are back!<br><br>&#9;After a while, my mother noticed my passion for photography and Digital Art. She ended up getting my first camera a Canon 70D and using her student email from the college she was going to, she got me access to the Adobe Creative Suite. After that I would run around all over LA taking pictures, then bringing them home and editing them; occasionally creating vector art here and there. Life was good, though there would be change to soon come."
        },
        {
            "title": "What Even is this Place?",
            "text": "Going to NAU was a mistake; not because going to university was a mistake, but that NAU wasn't the correct choose of university; I didn't realize this till it was too late. It would have been better to have looked at more universities, specifically the engineering department and whether it was capable of fueling my curiosity and creative like my time in high school was able to. However this wasn't my priority when looking at universities; around the time it came to decide where I wanted to go, I didn't have a definitive path I wanted to take. At the time, my side gig was spoiling on me because I viewed the business side of things as a chore; my mother also gave me an ultimatum that would push me towards the university path (either she would help fund my time in university or I had to move out and figure out life myself). Back then, LA was still nearly impossible to live in especially for a recent High School Graduate. So with that in mind and a notion that I wanted to do something in Computer Science; I would go to the first university that would accept me in their computer science program. I would apply to Humboldt, NAU, and ASU (a good start I will apply to more the next weekend) then 3 days later NAU accepted me; the problem was solved.<br><br>&#9;I was not ready this transition. Everything seemed so foreign to me; the culture, the interacts, and what threw me off the most was the drive. It was almost a corporate rise and grind mundane-ness rather than genuine interest. There were some threads I was able to grasp at; some being retired professionals that went into teaching, some students, and the art professors. I had even found a small group that were just fascinated by cyber security. I was very surprised the art program at NAU, the professors I had loved their craft and it introduced me into non-digital mediums that I would never think to explore on my own. Due to these classes I was able to preform and partake in Art Festivals and talk to many professional artist from the area. <br><br>&#9;However, this wouldn't be enough to sustain me throughout university after a while that corporate rise and grind eventually took over my life. I found myself waking up in the morning to work a bit on my second tech job(Working at NAU Open Source Lab), going to class, working on my primary tech job(Working at Deckers) between classes, then heading into the office to finish off the first tech job, finally ending the day with homework and whatever I needed to finish on the second tech job. I would do this for nearly two years, though out the remainder of my time in university."
        },
        {
            "title": "Lost and Struggling",
            "text": "The grind was finally over, I had finally graduated and shortly after was working only one job. My reward? Anxiety, Depression, Debt, and a lack of a sense of purpose and on top of it all the world was in the middle of a global pandemic. What had happen while I was gone? It would be a while before I wasn't able to break out of this lull and the mundane-ness persisted even after university.  <br><br>&#9;Luckily the same day that I had graduated, I moved onto the content team at deckers, so I guess I could focus on that for a bit. There was a lot of work to be done; the content team before I had a reputation of chaos and lawlessness, well this may be a bit of an exaggeration. So, there was a single thread connecting me to an aspect, a fragment of what I used to love or at least adjacent to what I love. However this lull and mundane-ness would persist though out 2021; any attempt I made to claw myself out only ended in failure. It was like I was climbing a slimy dungeon wall built to keep me in this place of meh."
        },
        {
            "title": "Lighting the Lantern",
            "text": "Something needed to change; the passion for what I loved to do was slipping further away; what seemed to be at the speed of light. Alright, how do we rekindle what I loved to do? How do I overcome this wall that stands before me? Well, there is that single thread; it is not much, but it is something. <br><br>&#9;Fortune also must have favoring me at this moment as well; around the same time I was put in charge of the Quality Assurance on the UGG team. I was able to take the advice and training I had acquired mixed with industry seminars and practices to achieve a level of quality in which the team had not achieved before, reaching a point where a time known for issues and bugs went pretty smoothly and had hardly any issues at all. I was also able to improve Web Accessibility standard, which allowed me to learn a different aspect of web development and gave me the ability to talk Web Dev with the Web Developers. My thread had turned into a string, but it still had some ways to go before it could hold my weight.<br><br>&#9;What else can help me grow? Well, there are other aspects of computer science I can explore. After 3-ish years of exploration and many unfinished projects; some of the topics I was able to explore were Embedded Programming, DevOps, Cyber Security, and Data Science. I had a blast learning all these new things, but something was missing. More thread had been add.<br><br>&#9;I had loss touch with my creative side. This was probably the most challenging to rekindle; where as my connection to programming was faint, but existing coming off of a programming gig and working in a tech field. No threads where connected, at this point it had been years since I had created any Illustrations or taken any photo; at this point my camera was buried at the bottom of a bin stashed in the back of my closet. I started by created small illustrations, trying to restore my skills like vinegar to rust. I eventually got to the point where I was picking my camera; taking pictures of the world around me. My rope has been spun; I can scale the wall set before me."
        },
        {
            "title": "What Is Next?",
            "text": "When I was in my time of exploration and reconstruction, I noticed myself coming back to web development; because I was either curious about some aspect I had stumbled upon or to seek refuge and relaxation. I plan on fully pursing Web Development in the foreseeable future; nothing else has as much wilderment, complexity, and capability for me as web development has had for me. The center, the balance between programming and art; containing both. The future contains so many mysteries, the only thing we can do now is to let them unfold; to see what comes next."
        }
    ]
}